// Створіть масив styles з елементами 'Джаз' і 'Блюз'
//Додайте в кінець 'Рок-н-ролл'
//Заменіть значення 'Блюз' на 'Класика'
//Видаліть перший елемент масива та виведіть його в консоль
// Додайте 'Реп' та 'Реггі' на початок списку.

// const styles = ["Джаз", "Блюз"];

// styles.push("Рок-н-ролл");

// const stylesIndex = styles.indexOf("Блюз");

// styles[stylesIndex] = "Класика";

// styles.splice(stylesIndex, 1, "Класика");

// console.log(styles.shift());

// styles.unshift("Реп", "Реггі");

// console.log(styles);

/*************************************************************************************************** */

// Напиши функцію, яка перебирає масив логінів і перевіряє
// чи є ім'я введене в інпут у цьому масиві і у разі,
// якщо є - виводить повідомлення "Доступ дозволено"
// в іншому випадку - "Користувач не знайден"

// const logins = ["Peter", "John", "Igor", "Sasha"];

// function loginName(array) {
// 	const name = prompt("Введіть ім'я");
// 	if (array.includes(name)) {
// 		alert("Доступ дозволено");
// 	} else {
// 		alert("Користувач не знайден");
// 	}
// }

// loginName(logins);

// Напишіть функцію logItems (array), яка приймає
// масив і використовує цикл for, який для кожного елемента
//буде виводити повідомлення у форматі:
//<номер елемента> - <значення елемента>
//Нумерація має починатись з 1

// const names = ["Alla", "Petro", "Max", "Olena", "Boris"];

// function logItems(array) {
// 	for (let index = 0; index < array.length; index++) {
// 		console.log(`${index + 1} - ${array[index]}`);
// 	}
// }
// logItems(names);
